[
  {
    "id": "20181",
    "title": "Stright Through Process",
    "description": "Auto insurance application which have many modules such as Add/Replace/Delate vehicles, Auto coverage, Driver Assignment, Edit Coverage, Careate/Edit/Delete policy,  Edit Driver and ect.",
    "role": "Senior UI Developer",
    "responsibilities": [
      "Worked closely with clients to define business objectives, project scope, solution space and design/development approach for various knowledge applications.",
      "Worked in Application Design, Object Oriented Design, Development, Documentation, Testing, Maintenance and Agile/Scrum Project Management.",
      "Managing scrum meeting, sprint backlog refinement, sprint planning, sprint review and sprint retrospective",
      "AngularJS 1.3 framework environment setup for UI development",
      "Developing and modifing angular directives and html views, controlers, models using HTML 5, CSS 3, JSON, AngularJS and JavaScript"
    ],
    "env": "AngularJS, HTML 5, CSS 3, JavaScript, Node.JS, NPM, Java, Apache Tomcat, RESTful Web Service, Atom, Postman, Chrome Developer Tool, SQL Developer, GIT, TortoiseSVN",
    "image": "",
    "link": "",
    "isFreeLanceProject": false,
    "period": "Oct 2017 - Till",
    "client": "The Hartdford",
    "company": "EGB Systems & Solutions Inc",
    "location": "Hartdford, CT"
  },
  {
    "id": "20172",
    "title": "Medallion",
    "description": "Medallion is a small disk that will be sent to every passenger before he or she leaves home. Tiny in size and massive in ability, the 1.8-ounce Ocean Medallion is the shape of a quarter and stores the information that travelers provide- not just online before the trip but also in real time as the device is powered through another creation, the company's Ocean Compass digital concierge. You can wear the Medallion around your wrist (like an Apple Watch), around your neck (like a pendant) or just carry it in your pocket. Benefits of Ocean Medallion include streamlined embarkation and debarkation, the ability to locate friends and family throughout the ship, better interactions with crew members who also will have devices and easier ways to access dining and entertainment throughout the cruise.",
    "role": "Senior UI Developer",
    "responsibilities": [
      "Worked closely with clients to define business objectives, project scope, solution space and design/development approach for various knowledge applications.",
      "Setting up ReactJS framework for UI development.",
      "Developed html views using HTML 5, CSS 3, JSON, and JavaScript.",
      "Used ReactJS to make the HTML, DHTML and CSS code interact with the JavaScript functions to add dynamism to the web pages at the client side.Developed html views using HTML 5, CSS 3, JSON, and JavaScript.",
      "Writing front-end code like HTML, CSS, SASS, ReactJS, RequireJS, Redux and various other JavaScript frameworks and writing Web Services using Spring Boot RESTful service.",
      "Generated server side PL/SQL scripts for data manipulation and validation and materialized views for remote instances.",
      "Developed PL/SQL triggers and master tables for automatic creation of primary keys",
      "Created PL/SQL Stored Procedures, Functions and Packages for moving the data from staging area to data mart.",
      "Code enhancement, Unit Test case writing using Chai, Jasmine and bug fixes.",
      "Created wireframes, storyboards, user flows, and documentation and site maps to effectively communicate design ideas.",
      "Developing custom components using ReactJS & Redux.",
      "Developing Controllers, Views, Services and Components."

    ],
    "env": "React.JS, Webpack, Babel, ES6, Moment, Redux, HTML 5, CSS 3, JavaScript, Node.JS, NPM, Java, Apache Tomcat, Spring Boot, RESTful Web Service, Oracle 11g, PL/SQL, Linux, Atom, Postman, Chrome Developer Tool, SQL Developer, GIT",
    "image": "",
    "link": "",
    "isFreeLanceProject": false,
    "period": "Mar 2017 - Sep 2017",
    "client": "Carnival",
    "company": "Capgemini America Inc",
    "location": "Hartdford, CT"
  },
  {
    "id":"20163",
    "title": "MyPower – Customer Portal",
    "description": "Redesign existing customer portal and applying new technologies. We have many applications which will accessible based on customer profile. The applications are TILs, O&M, Outages and etc. Dashboard will be loaded based on the user profile. Dashboard contains many applications cards which are loading by user profile setup and application should be accessible based on the user privileges.",
    "role": "Senior UI Developer",
    "responsibilities": [
      "Worked closely with clients to define business objectives, project scope, solution space and design/development approach for various knowledge applications.",
      "Designed Frontend with in object oriented JavaScript Framework using Angular.JS, Polymer.JS, Node.JS, Grunt and Power.",
      "Worked one-on-one with client to develop layouts and implemented into a final interface design with Angular.JS, Polymer.JS & RESTful Web Service using Spring Boot.",
      "Used advanced level of HTML5, JavaScript, CSS3 and pure CSS table less layout, Responsive Design and applied Predix 2.0 standards.",
      "Generated server side PL/SQL scripts for data manipulation and validation and materialized views for remote instances.",
      "Developed PL/SQL triggers and master tables for automatic creation of primary keys.",
      "Created PL/SQL Stored Procedures, Functions and Packages for moving the data from staging area to data mart.",
      "Produced content pages with CSS3 layout and style markup presentations and also used JavaScript methods and properties.",
      "Created CSS templates for use in all pages on the website working with CSS Background, positioning, text, border, margin, padding, table, Pseudo classes, Pseudo elements and CSS3 Border, CSS3 Background, CSS3 Transitions.",
      "Used JSON for data interchange, as it's faster and can be parsed using JavaScript.",
      "Extensively worked with Predix 2.0, AngularJS and PolymerJS.",
      "Worked Web Service integration with Angular service with RESTful web service.",
      "Created logical and physical data models putting to practice, concepts of normalization and RDBMS.",
      "Worked with the team of architects and back-end Developers to gather requirements and enhance the application functionality and add new features."
    ],
    "env": "Predix 2.0, Polymer.JS, Angular.JS 1.4, jQuery, RESTful, HTML 5, JavaScript, JSON, CSS 3, Java, Apache Tomcat, J2ee, Spring, Node.JS, Grunt, Bower, NPM, PostgreSQL, Windows, Eclipse, JIRA, Notepad++, SQL Developer, GIT",
    "image": "",
    "link": "",
    "isFreeLanceProject": false,
    "period": "Jul 2016 – Dec 2016",
    "client": "GE Power & Water",
    "company": "Capgemini America Inc",
    "location": "Atlanta, GA"
  },
  {
    "id":"",
    "title": "",
    "description": "",
    "role": "",
    "responsibilities": "",
    "env": "",
    "image": "",
    "link": "",
    "isFreeLanceProject": false,
    "period": "",
    "client": "",
    "company": "Capgemini America Inc",
    "location": ""
  }
]
